Applying **dev**:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_generated_zip_file has been changed
  ~ resource "aws_s3_object" "lambda_generated_zip_file" {
        id                 = "dev/lambda/generated/output_event_message.zip"
+       metadata           = {}
+       tags               = {}
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.output_event_message will be updated in-place
  ~ resource "aws_lambda_function" "output_event_message" {
        id                             = "dev-edp-output-event-message"
      ~ last_modified                  = "2022-05-15T14:09:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "KEQpdnGpbDY252Ls818v3Lt+PcjuxY+qHK4xHs3zdWg=" -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.archive_file.lambda_generated_zip_file will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_generated_zip_file"  {
      ~ id                  = "e0230329821b942b290476ac5ecd0f78cc4f760f" -> (known after apply)
      ~ output_base64sha256 = "KEQpdnGpbDY252Ls818v3Lt+PcjuxY+qHK4xHs3zdWg=" -> (known after apply)
      ~ output_md5          = "cb8cad77086737ceda5e8b6b2d5fae34" -> (known after apply)
      ~ output_path         = "../../files/python_lambda_package/package.zip" -> (known after apply)
      ~ output_sha          = "e0230329821b942b290476ac5ecd0f78cc4f760f" -> (known after apply)
      ~ output_size         = 1235493 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.null_data_source.packaging_changes will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "packaging_changes"  {
      ~ has_computed_default = "default" -> (known after apply)
      ~ id                   = "static" -> (known after apply)
      ~ inputs               = {
          ~ "null_id"      = "9013528899667388037" -> (known after apply)
            # (1 unchanged element hidden)
        }
      ~ outputs              = {
-           "null_id"      = "9013528899667388037"
-           "package_path" = "../../files/python_lambda_package/package.zip"
        } -> (known after apply)
      ~ random               = "1483170731200571377" -> (known after apply)
    }

  # module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_generated_zip_file will be updated in-place
  ~ resource "aws_s3_object" "lambda_generated_zip_file" {
      ~ etag               = "cb8cad77086737ceda5e8b6b2d5fae34" -> (known after apply)
        id                 = "dev/lambda/generated/output_event_message.zip"
      ~ source             = "../../files/python_lambda_package/package.zip" -> (known after apply)
        tags               = {}
      ~ version_id         = "6IFNNPevj1M0WN4aFNzXLHB_7K3U1nsa" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.null_resource.packaging must be replaced
-/+ resource "null_resource" "packaging" {
      ~ id       = "9013528899667388037" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "src_hash" = "53e6430af60f8b20f2d09ef3c3a933784811dd28" -> "3b4d5ab9c0623328965bde72c28fe33bee29a397"
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

```
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Destroying... [id=9013528899667388037]
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Destruction complete after 0s
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Creating...
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Provisioning with 'local-exec'...
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Executing: ["/bin/sh" "-c" "rm -rf ../../files/python_lambda_package"]
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Provisioning with 'local-exec'...
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Executing: ["/bin/sh" "-c" "mkdir ..\\..\\files\\python_lambda_package"]
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Provisioning with 'local-exec'...
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Executing: ["/bin/sh" "-c" "pip3 install -r ../../lambdas/output_event_message/requirements.txt --target ../../files/python_lambda_package"]
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Collecting requests
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec):   Downloading requests-2.27.1-py2.py3-none-any.whl (63 kB)
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Collecting charset-normalizer~=2.0.0; python_version >= "3"
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec):   Downloading charset_normalizer-2.0.12-py3-none-any.whl (39 kB)
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Collecting idna<4,>=2.5; python_version >= "3"
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec):   Downloading idna-3.3-py3-none-any.whl (61 kB)
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Collecting certifi>=2017.4.17
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec):   Downloading certifi-2021.10.8-py2.py3-none-any.whl (149 kB)
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Collecting urllib3<1.27,>=1.21.1
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec):   Downloading urllib3-1.26.9-py2.py3-none-any.whl (138 kB)
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Installing collected packages: charset-normalizer, idna, certifi, urllib3, requests
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Successfully installed certifi-2021.10.8 charset-normalizer-2.0.12 idna-3.3 requests-2.27.1 urllib3-1.26.9
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Provisioning with 'local-exec'...
module.lambda.module.lambda_python_dependencies.null_resource.packaging (local-exec): Executing: ["/bin/sh" "-c" "cp -r ../../lambdas/output_event_message/** ../../files/python_lambda_package/"]
module.lambda.module.lambda_python_dependencies.null_resource.packaging: Creation complete after 2s [id=1791852798407601409]
module.lambda.module.lambda_python_dependencies.data.null_data_source.packaging_changes: Reading... [id=static]
module.lambda.module.lambda_python_dependencies.data.null_data_source.packaging_changes: Read complete after 0s [id=static]
module.lambda.module.lambda_python_dependencies.data.archive_file.lambda_generated_zip_file: Reading... [id=e0230329821b942b290476ac5ecd0f78cc4f760f]
module.lambda.module.lambda_python_dependencies.data.archive_file.lambda_generated_zip_file: Read complete after 0s [id=88928d5b85cc9e7ac1725bccf0ca8656bae2c121]
module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_generated_zip_file: Modifying... [id=dev/lambda/generated/output_event_message.zip]
module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_generated_zip_file: Modifications complete after 1s [id=dev/lambda/generated/output_event_message.zip]
module.lambda.aws_lambda_function.output_event_message: Modifying... [id=dev-edp-output-event-message]
module.lambda.aws_lambda_function.output_event_message: Modifications complete after 6s [id=dev-edp-output-event-message]

Warning: Deprecated Resource

  with module.lambda.module.lambda_python_dependencies.data.null_data_source.packaging_changes,
  on ../../modules/lambda_python_dependencies/lambda_python_dependencies.tf line 73, in data "null_data_source" "packaging_changes":
  73: data "null_data_source" "packaging_changes" {

The null_data_source was historically used to construct intermediate values
to re-use elsewhere in configuration, the same can now be achieved using
locals
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 2 changed, 1 destroyed.

Outputs:

lambda_function_arn = "arn:aws:lambda:eu-west-1:534376519123:function:dev-edp-output-event-message"
live = "no"
s3_bucket_arn = "arn:aws:s3:::dev-landing-edp,arn:aws:s3:::dev-staging-edp,arn:aws:s3:::dev-staging-processed-edp"
s3_bucket_id = "dev-landing-edp,dev-staging-edp,dev-staging-processed-edp"
sns_topic_arn = "arn:aws:sns:eu-west-1:534376519123:edp-s3-event-notification"

```